; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-3-29)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s2)
	(at driver5 s0)
	(at driver6 s1)
	(at driver7 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	(at package4 s1)
	(at package5 s1)
	(at package6 s2)
	(at package7 s1)
	(at package8 s1)
	(at package9 s1)
	(at package10 s1)
	(at package11 s2)
	(at package12 s1)
	(at package13 s1)
	(at package14 s1)
	(at package15 s0)
	(at package16 s2)
	(at package17 s0)
	(at package18 s1)
	(at package19 s0)
	(at package20 s2)
	(at package21 s2)
	(at package22 s2)
	(at package23 s2)
	(at package24 s2)
	(at package25 s0)
	(at package26 s2)
	(at package27 s0)
	(at package28 s2)
	(at package29 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
)
	(:goal (and
	(at driver5 s0)
	(at driver6 s1)
	(at truck1 s0)
	(at truck3 s1)
	(at package1 s2)
	(at package2 s0)
	(at package3 s2)
	(at package4 s2)
	(at package5 s0)
	(at package6 s1)
	(at package7 s2)
	(at package8 s0)
	(at package9 s1)
	(at package10 s2)
	(at package11 s0)
	(at package12 s1)
	(at package13 s2)
	(at package14 s0)
	(at package15 s2)
	(at package16 s2)
	(at package17 s0)
	(at package18 s2)
	(at package19 s0)
	(at package20 s2)
	(at package21 s1)
	(at package22 s0)
	(at package23 s1)
	(at package24 s2)
	(at package25 s0)
	(at package26 s2)
	(at package27 s2)
	(at package28 s1)
	(at package29 s1)
	))


)

; plan
1. (load-truck s0 package29 truck2)
   deleted: (at package29 s0)
   added: (in package29 truck2)
   goals met: 13 of 33
2. (board-truck driver7 s0 truck2)
   deleted: (at driver7 s0) (empty truck2)
   added: (driving driver7 truck2)
   goals met: 13 of 33
3. (drive-truck driver7 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 13 of 33
4. (load-truck s1 package8 truck2)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   goals met: 13 of 33
5. (load-truck s1 package7 truck2)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   goals met: 13 of 33
6. (load-truck s1 package5 truck2)
   deleted: (at package5 s1)
   added: (in package5 truck2)
   goals met: 13 of 33
7. (load-truck s1 package4 truck2)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 13 of 33
8. (drive-truck driver7 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 13 of 33
9. (unload-truck s2 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s2)
   goals met: 14 of 33
10. (load-truck s2 package6 truck2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   goals met: 14 of 33
11. (drive-truck driver7 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 14 of 33
12. (unload-truck s1 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   goals met: 15 of 33
13. (load-truck s1 package3 truck2)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   goals met: 15 of 33
14. (drive-truck driver7 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 15 of 33
15. (unload-truck s2 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   goals met: 16 of 33
16. (unload-truck s2 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   goals met: 17 of 33
17. (load-truck s2 package28 truck2)
   deleted: (at package28 s2)
   added: (in package28 truck2)
   goals met: 17 of 33
18. (drive-truck driver7 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 17 of 33
19. (drive-truck driver7 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 17 of 33
20. (unload-truck s1 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s1)
   goals met: 18 of 33
21. (unload-truck s1 package28 truck2)
   deleted: (in package28 truck2)
   added: (at package28 s1)
   goals met: 19 of 33
22. (drive-truck driver7 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 19 of 33
23. (unload-truck s0 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s0)
   goals met: 20 of 33
24. (unload-truck s0 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   goals met: 21 of 33
25. (drive-truck driver7 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 21 of 33
26. (load-truck s2 package23 truck2)
   deleted: (at package23 s2)
   added: (in package23 truck2)
   goals met: 21 of 33
27. (drive-truck driver7 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 21 of 33
28. (unload-truck s1 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s1)
   goals met: 22 of 33
29. (load-truck s1 package18 truck2)
   deleted: (at package18 s1)
   added: (in package18 truck2)
   goals met: 22 of 33
30. (drive-truck driver7 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 22 of 33
31. (load-truck s2 package22 truck2)
   deleted: (at package22 s2)
   added: (in package22 truck2)
   goals met: 22 of 33
32. (drive-truck driver7 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 22 of 33
33. (load-truck s0 package27 truck2)
   deleted: (at package27 s0)
   added: (in package27 truck2)
   goals met: 22 of 33
34. (drive-truck driver7 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 22 of 33
35. (unload-truck s2 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s2)
   goals met: 23 of 33
36. (load-truck s2 package21 truck2)
   deleted: (at package21 s2)
   added: (in package21 truck2)
   goals met: 23 of 33
37. (drive-truck driver7 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 23 of 33
38. (drive-truck driver7 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 23 of 33
39. (unload-truck s1 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s1)
   goals met: 24 of 33
40. (load-truck s1 package14 truck2)
   deleted: (at package14 s1)
   added: (in package14 truck2)
   goals met: 24 of 33
41. (drive-truck driver7 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 24 of 33
42. (unload-truck s0 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s0)
   goals met: 25 of 33
43. (load-truck s0 package15 truck2)
   deleted: (at package15 s0)
   added: (in package15 truck2)
   goals met: 25 of 33
44. (drive-truck driver7 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 25 of 33
45. (unload-truck s2 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s2)
   goals met: 26 of 33
46. (unload-truck s2 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s2)
   goals met: 27 of 33
47. (drive-truck driver7 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 27 of 33
48. (unload-truck s0 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s0)
   goals met: 28 of 33
49. (load-truck s0 package1 truck2)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   goals met: 28 of 33
50. (drive-truck driver7 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 28 of 33
51. (unload-truck s2 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s2)
   goals met: 29 of 33
52. (board-truck driver6 s1 truck1)
   deleted: (at driver6 s1) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 28 of 33
53. (load-truck s1 package13 truck1)
   deleted: (at package13 s1)
   added: (in package13 truck1)
   goals met: 28 of 33
54. (drive-truck driver6 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 28 of 33
55. (unload-truck s2 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s2)
   goals met: 29 of 33
56. (drive-truck driver6 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 30 of 33
57. (drive-truck driver6 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 29 of 33
58. (disembark-truck driver6 s1 truck1)
   deleted: (driving driver6 truck1)
   added: (at driver6 s1) (empty truck1)
   goals met: 30 of 33
59. (load-truck s1 package10 truck3)
   deleted: (at package10 s1)
   added: (in package10 truck3)
   goals met: 30 of 33
60. (board-truck driver6 s1 truck3)
   deleted: (at driver6 s1) (empty truck3)
   added: (driving driver6 truck3)
   goals met: 29 of 33
61. (drive-truck driver6 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 28 of 33
62. (load-truck s2 package11 truck3)
   deleted: (at package11 s2)
   added: (in package11 truck3)
   goals met: 28 of 33
63. (drive-truck driver6 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 29 of 33
64. (disembark-truck driver6 s1 truck3)
   deleted: (driving driver6 truck3)
   added: (at driver6 s1) (empty truck3)
   goals met: 30 of 33
65. (board-truck driver6 s1 truck1)
   deleted: (at driver6 s1) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 29 of 33
66. (unload-truck s1 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s1)
   goals met: 29 of 33
67. (drive-truck driver6 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 30 of 33
68. (drive-truck driver7 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 30 of 33
69. (load-truck s1 package11 truck2)
   deleted: (at package11 s1)
   added: (in package11 truck2)
   goals met: 30 of 33
70. (drive-truck driver6 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 29 of 33
71. (disembark-truck driver6 s1 truck1)
   deleted: (driving driver6 truck1)
   added: (at driver6 s1) (empty truck1)
   goals met: 30 of 33
72. (board-truck driver6 s1 truck3)
   deleted: (at driver6 s1) (empty truck3)
   added: (driving driver6 truck3)
   goals met: 29 of 33
73. (drive-truck driver6 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 28 of 33
74. (unload-truck s2 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s2)
   goals met: 29 of 33
75. (disembark-truck driver7 s1 truck2)
   deleted: (driving driver7 truck2)
   added: (at driver7 s1) (empty truck2)
   goals met: 29 of 33
76. (drive-truck driver6 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 30 of 33
77. (disembark-truck driver6 s1 truck3)
   deleted: (driving driver6 truck3)
   added: (at driver6 s1) (empty truck3)
   goals met: 31 of 33
78. (board-truck driver7 s1 truck1)
   deleted: (at driver7 s1) (empty truck1)
   added: (driving driver7 truck1)
   goals met: 31 of 33
79. (drive-truck driver7 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 32 of 33
80. (board-truck driver6 s1 truck2)
   deleted: (at driver6 s1) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 31 of 33
81. (drive-truck driver6 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 31 of 33
82. (unload-truck s0 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s0)
   goals met: 32 of 33
83. (drive-truck driver6 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 32 of 33
84. (disembark-truck driver6 s1 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s1) (empty truck2)
   goals met: 33 of 33
